In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df1 = { 'name': [ 'vipul','ajay'],'id':[1,2],'country':['africa','antartica']}
df2 = { 'name' : [ 'bharat','nilofar'],'id':[3,4],'country':['pakishtan','india']}

In [3]:
df1

{'name': ['vipul', 'ajay'], 'id': [1, 2], 'country': ['africa', 'antartica']}

In [4]:
df2

{'name': ['bharat', 'nilofar'],
 'id': [3, 4],
 'country': ['pakishtan', 'india']}

In [5]:
df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)

In [6]:
df1

    name  id    country
0  vipul   1     africa
1   ajay   2  antartica

In [7]:
df2

      name  id    country
0   bharat   3  pakishtan
1  nilofar   4      india

In [8]:
df = pd.concat([df1,df2])

In [13]:
df.reset_index(drop=True)

      name  id    country
0    vipul   1     africa
1     ajay   2  antartica
2   bharat   3  pakishtan
3  nilofar   4      india

In [16]:
order =  { 'cid':[1001,1002,1003,1004],'oid':[1232323,232423,232323,324342],
         'name' : ['earphone','laptop','mobile','earphone']
         }

In [17]:
customer = { 'cid':[1003,1004,1002,1001,1006,1005],
            'name':['sachin','ajay','vipul','bharat','nilofar','nidhi'],
           'country':['india','us','japan','chines','brazil','indonesia']}

In [18]:
order = pd.DataFrame(order)

In [19]:
customer = pd.DataFrame(customer)

In [22]:
order

    cid      oid      name
0  1001  1232323  earphone
1  1002   232423    laptop
2  1003   232323    mobile
3  1004   324342  earphone

In [23]:
customer

    cid     name    country
0  1003   sachin      india
1  1004     ajay         us
2  1002    vipul      japan
3  1001   bharat     chines
4  1006  nilofar     brazil
5  1005    nidhi  indonesia

In [25]:
df = pd.merge(customer,order,on='cid')

In [26]:
df

    cid  name_x country      oid    name_y
0  1003  sachin   india   232323    mobile
1  1004    ajay      us   324342  earphone
2  1002   vipul   japan   232423    laptop
3  1001  bharat  chines  1232323  earphone

In [39]:
df = df.pivot_table(values='cid',index='oid',columns='name_x')

In [40]:
df['ajay'].sum()

1004.0